{
      "done": [
            "At the time of its launch, the Boeing 747-200 represented the next step for the company’s iconic four-engine",
            "Air Canada Rouge, the lower-cost subsidiary and leisure airline of the Canadian flag carrier, took to the skies",
            "The Brazilian carrier Azul Linhas Aereas will add capacity on its routes to Portugal later this year. By",
            "Modern jets, such as the 787 and A350, have seen a switch to composite materials for fuselage construction.",
            "The United States is officially making plans to lift the ban on travel to the States from November.",
            "Fort Worth-based US legacy carrier and oneworld founding member American Airlines is very loyal to Boeing’s widebody families. Indeed,",
            "Dubai-based carrier Emirates is looking to further increase its flight operations to the United States of America as",
            "Delta had 185 MD-88s and MD-90s, whose retirement was accelerated to June 2020 because of the pandemic. With",
            "Boeing’s 737 MAX is now allowed to fly in most countries, with India recently lifted its MAX ban.",
            "London’s airports are amongst the busiest in the world, and more capacity is needed. Whilst a third runway",
            "Virgin Atlantic is well known for specializing in long-haul travel from various UK airports. However, in the mid-2010s,",
            "Seats on Air New Zealand’s flights to Australia over October sold out within minutes when released on Monday",
            "It was a joyful day for airlines in the United States and Europe as news broke that the",
            "When aircraft have to land due to an issue that is not an emergency, they will often return",
            "Troubled Hong Kong airline Cathay Pacific has slashed its capacity projections for the last quarter of the year",
            "Emirates will deploy its two-class, 615-seat A380 – by far the world’s densest-configured double-decker – from Dubai to",
            "Virgin Australia continues to expand its presence in Tasmania. On Tuesday, the airline confirmed it would resume flights",
            "Today marks 32 years since the crash of USAir Flight 5050. On September 20th, 1989, a Boeing 737-400",
            "UK-based airlines and tour operators are reporting a surge in flight and holiday bookings in the wake of",
            "European low-cost carrier Ryanair is set to reintroduce its flight change fee for bookings from the end of",
            "India’s former full-service carrier Jet Airways was one of the largest Boeing 737 MAX customers. Before going bankrupt,",
            "India’s former full-service airline Jet Airways was one of the largest Boeing 737 MAX customers. Before going bankrupt,",
            "Hawker Siddeley Trident, designated as the HS121, was designed as a medium-range jet for fast inter-city travel. Conceived for",
            "Boeing’s 737 MAX is now allowed to fly in most countries, with India recently lifting its MAX ban.",
            "Russia’s aviation authority, Rosaviatsiya, has published preliminary data for August 2021 passenger traffic, and the figures look promising.",
            "German design house Lufthansa Technik has teased a new cabin concept for the ACJ330. The concept, called &#8216;Explorer,’",
            "Lufthansa has removed another Boeing 747-400 from storage. The aircraft departed from Twente as DLH1ENS, a unique flight",
            "It has been a quarter of a century since Iberia received its first A340. Registered EC-GGS, it was",
            "As easyJet mulls over its electric and hydrogen aircraft options for its future fleet, its management is calling",
            "The Etihad Airways Airbus A350-1000 fleet in Abu Dhabi has grown slightly as another of the aircraft left",
            "Europes airlines have seen a surge in booking overnight as the United States of America revealed that it",
            "Panama’s Copa Airlines has put its next US destination on sale: Atlanta. Starting in December, Atlanta is the",
            "Inmarsat has today announced a game changing new platform for inflight passenger experience. Called OneFi, the new portal",
            "Logistics company DHL has now shipped over one billion vaccines to more than 160 countries since December 2020.",
            "Low-cost Spanish airline Vueling has been awarded 18 new slots at Paris Orly airport. The airline will operate",
            "After many months, the US has agreed to welcome fully vaccinated citizens from most European nations from November.",
            "British Airways was forced to send a considerable portion of its fleet into long-term storage as the effects",
            "On September 21, 2005, a JetBlue flight between Burbank and New York City had to do an emergency",
            "Welcome to our eighth routes newsletter, full of the latest colorful photos of new routes and route relaunches.",
            "The electric vertical takeoff and landing (eVTOL) market has just taken a significant turn. With this industry yet",
            "On September 21, 2005, a JetBlue flight between Burbank and New York City had to perform an emergency",
            "Europe’s airlines have seen a surge in bookings overnight as the United States of America revealed that it",
            "The Brazilian carrier GOL Linhas Aereas announced a partnership with Avolon, the leasing company, to commercialize an electric",
            "The Federal Aviation Administration (FAA) has asked US-based airlines to do more to combat unruly passenger behavior. The",
            "The United States Department of Justice (DOJ) has formally filed a lawsuit against American Airlines and JetBlue over",
            "What is 18 hours in the air when you are one of the world’s most experienced long-haul airlines?",
            "Hanoi-based Bamboo Airways is about to sign a multi-billion dollar deal with General Electric to power its Boeing",
            "JetBlue and Spirit Airlines have come out making a case for why they should receive the slots coming",
            "Launching an airline during a pandemic wouldn’t be the first choice for many. Yet, that’s exactly what’s happening",
            "Radical surgery is planned at Garuda Indonesia as the beleaguered airline flags entering into a formal restructuring process",
            "It is coming to the end of an era for the MD-11 freighter aircraft used by Lufthansa. Having",
            "The British Airline Pilots Association (BALPA) has said that it is partnering with Norwegian low-cost startup airline Norse",
            "Ever wondered about the most profitable European operations to the US? Wonder no more. Using RDC Aviation data,",
            "Airbus is set to upgrade more than 200 LATAM aircraft to allow them to complete a continuous descent",
            "Ever since it came to light that Rolls-Royce was suffering durability issues on its flagship Trent 1000 engines,",
            "Airbus has today revealed a creative new wing demonstrator. The Xtra-Performance Wing can increase its wingspan and has",
            "After more than a year and a half, Argentina seems to be easing its travel restrictions for international",
            "South African Airways (SAA) is just a day away from its much-anticipated relaunch after ceasing all operations almost",
            "Aeroflot is launching and Emirates is resuming flights between St Petersburg and Dubai this October, coinciding with the",
            "This time last year, Airbus revealed three concept aircraft, presently going by the name of ZEROe. The aviation",
            "Hamburg Airways was founded in 2010 by Managing Director and CEO Sergej Fieger following the collapse of charter",
            "The Airbus A380 has been one of the most iconic aircraft of the last few decades, despite not",
            "On Friday at midday, Dechow will put thousands of pieces of &#8216;Lufthansa’ Boeing 707s on auction. The parts",
            "In January 2020, news broke that Airbus would be introducing dimmable windows, rivaling those of the Boeing 787",
            "Europe’s path to recovery has stalled, based on analyzing flight data from Eurocontrol. Movements remain down by ~30%",
            "Boeing is donating US$1 million from its charitable trust to assist with disaster recovery and relief efforts in",
            "Ambitious startup Northern Pacific Airways has secured its first six Boeing 757s ahead of a planned launch of",
            "Today sees Lufthansa commencing its traditional Trachtencrew flights. The flights are intended to celebrate the annual Oktoberfest beer",
            "When it comes to continental Europe, airports like Paris, Frankfurt, Amsterdam, and Madrid tend to get most of",
            "For 30 years, NASA’s Space Shuttle program carried out important space missions, enthralling viewers with fascinating visuals of",
            "Qantas is keeping all but one of its Boeing 787-9 Dreamliners in the air. Despite not operating their",
            "Canada is preparing to start direct flights from India from September 27th and is currently testing out new",
            "Taipei-based Starlux Airlines is expecting its first Airbus A330-900neo early in 2022, paving the way for the airline’s",
            "September 23rd, 2019, marked the end of Thomas Cook Airlines. It was on this day, exactly two years",
            "XL Airways used to be a significant name in the UK leisure market, operating charter flights both to",
            "The Indonesian capital of Jakarta has more departures by Singapore Airlines this week than any other destination. It",
            "It’s been more than a month since Embraer released its latest iteration of its highly anticipated new turboprop",
            "South African Airways is back. The airline operated the first flight of its return earlier today, operating from",
            "Indian carrier Vistara is seeking to expand its long-haul network. The airline today revealed plans to add the",
            "Germany’s leisure airline, Condor, has put on sale a five-weekly service between Frankfurt – the carrier’s main airport",
            "Russia and China have started production of the COMAC C929, the joint-venture widebody aircraft which seeks to rival",
            "Russia and China have started production of the CRAIC C929, the joint-venture widebody aircraft which seeks to rival",
            "British Airways has confirmed that it will be suspending short-haul services from London Gatwick, save from a handful",
            "The European Union wants to achieve climate neutrality within the next 30 years. Airbus shares this mission and",
            "Finnish carrier Finnair has successfully recycled 99.2% of an Airbus A319 in a hangar at its Helsinki home.",
            "After formally launching the A350 freighter program in July, without a launch customer, Airbus has provided an update",
            "Over the last few months, American Airlines and JetBlue have been rolling out a comprehensive partnership called the",
            "Simple Flying’s latest podcast is live and ready for you to enjoy. Hosted this week by Tom Boon, our",
            "Delta has put two UK routes back on sale, both restarting in summer 2022. Boston to Edinburgh is",
            "Los Angeles and Seattle are two of the largest cities on the West Coast of the United States.",
            "American Airlines has built its success on connecting passengers from all corners of the globe, to get them",
            "As airports grow over the years, some of the newly built runways may be far away from the",
            "Airbus has been intricately detailing its strategy to meet sustainability deadlines over the coming decades. The manufacturing giant",
            "Lessors are often the unseen powerhouses behind some of the world’s largest airlines. While some airlines prefer to",
            "Russia and China have started production of the CRAIC CR929, the joint-venture widebody aircraft which seeks to rival",
            "Emirates is thinking about bringing back the Airbus A380 to Brazil after more than a year of not",
            "The on-again-off-again rumors of Delta ordering the Boeing 737 MAX are back on. Recently, Delta’s CEO, Ed Bastian,",
            "Vietnam’s aviation safety regulators are mulling lifting their ban on the 737 MAX landing at Vietnamese airports. Vietnam",
            "Regional Express (Rex) has become the most recent Australian airline to mandate COVID-19 vaccinations among its workforce. Rex",
            "Chinese airlines are not always associated with the cutting edge of good seat design, but Beijing-based Air China",
            "In a milestone achievement, Bamboo Airways became the first Vietnamese airline to launch a passenger flight to a",
            "In November of 2019, Filipino carrier Cebu Pacific finalized a deal with Airbus for 16 A330-900 aircraft. With",
            "At the start of next month, the emirate of Dubai will welcome the world as it hosts Expo",
            "Particularly when sitting towards the center of an airliner, the noise of an aircraft’s landing gear being lowered",
            "The history of the UK airline industry has seen numerous regional airlines come and go since the advent",
            "Think Qatar Airways, think widebodies and long-haul flights. Yet the oneworld carrier has 32 narrowbodies operating scheduled flights",
            "Russia is set to refresh its Ilyushin Il-96 widebody with a program that will see the rare quadjet",
            "Today, almost 300 parts of a former El Al Boeing 707 went up for auction, alongside another Boeing",
            "Because of differences between the regional authorities in Catalonia and the Spanish national government, Barcelona Airport’s €1.7 billion",
            "With over 370 Boeing 737 MAX aircraft now flying, there are now in service than when grounded in",
            "UK borders have been plunged into chaos due to a systems failure rendering the e-gates unavailable. The e-gates",
            "American Airlines took the decision not to return to a number of seasonal summer destinations in Europe this",
            "British Airways’ oldest Airbus A380 is operating its first long-haul flight since the start of the pandemic, albeit",
            "European manufacturer Airbus is best known for its wide range of commercial passenger and freight-carrying aircraft. However, the",
            "Almost exactly three months after it was revealed, Turkish Airlines’ first flight from Istanbul to Dallas Fort Worth",
            "Embraer is a dominant force in the regional jet market, with its new E2s rapidly building on the",
            "Rolls-Royce highlights that it is leading a significantly technical initiative to build the world’s fastest all-electric aircraft. Its",
            "Unruly passenger behavior continues to be a problem for airlines in the United States. With the situation not",
            "LOT Polish Airlines will not be taking up its two Boeing 787 aircraft that are currently in the",
            "American Airlines is the largest international operator in South America, and has become even a South American brand,",
            "United Airlines is facing a $1.9 million fine over lengthy tarmac delays. The United States Department of Transportation",
            "Newark Liberty International Airport (EWR) in New Jersey is moving forward with construction on a new Terminal A.",
            "As aircraft efficiency and performance improve and fuel prices stay low, we are seeing a rise in extremely",
            "Established in 1946, Cathay Pacific has reached the impressive age of 75 years. The Hong Kong-based airline, founded",
            "Icelandic startup PLAY has achieved a lot in its first few months of operation. Operating its first flight",
            "Switzerland national flag carrier SWISS plans to resume its prestigious Geneva to New York flights on select days",
            "German leisure airline Condor has been in operation for 65 years now, flying guests to holiday destinations in",
            "Finnish national flag carrier Finnair has signed a codeshare agreement with Turkish Airlines to help offer its customers",
            "American Airlines retired two widebody types in 2020: the Boeing 767 and Airbus A330s. In addition to the",
            "The Boeing 737-300 was the first variant from the 737 Classic series to take to the skies, doing",
            "Last week Spanish national flag carrier Iberia celebrated 75 years of flights between Europe and Latin America. On",
            "Over the years, several major American carriers have dabbled in the world of low-cost subsidiaries. For example, Delta",
            "Icelandair is set to deploy its new Boeing 737 MAX 8 series aircraft on a new long-haul route",
            "Lyon Airport will play a crucial role in the next chapter of aviation. The site will pilot Airbus’",
            "Last week, Spanish national flag carrier Iberia celebrated 75 years of flights between Europe and Latin America. On",
            "Due to extensive uncertainty regarding international travel amid the coronavirus pandemic, domestic travel has become increasingly important in",
            "American ultra-low-cost carrier Allegiant Air will be ceasing services to Cleveland Hopkins International Airport (CLE) by early next",
            "One city that has received outsized attention from American Airlines in 2021 is Austin. The capital of Texas",
            "Air Slovakia was a small scheduled and charter airline based in Bratislava, the capital city of the country",
            "Flight KQ118 is a regularly scheduled service between Nairobi (Kenya) and Amsterdam (Netherlands). Operated by a Boeing 787-8, the",
            "When assessing the state of a given aircraft manufacturer’s order and delivery books, the term &#8216;white tail’ is",
            "In Spain’s Canary Islands, La Palma Airport (SPC) was shut down on Saturday because of an ash cloud",
            "Welcome to our last &#8216;Sunday Reads’ weekly digest for the month of September 2021! There has been no",
            "Earlier this week, a Honolulu-bound Hawaiian Airlines Airbus A330 had to divert to Midway following an inflight issue.",
            "Following the light aircraft crash at Teesside International Airport (MME), the airport operators have decided to close the",
            "The McDonnell Douglas MD-11 was one of the most visually striking aircraft of its time. Developed from the",
            "As travel restrictions have started to come back down between the United States and Europe, KLM is preparing",
            "For the bulk of the 20th century, Fokker was a big name among European aircraft manufacturers. Overall, it",
            "Oman Air has announced that it intends to apply to join the oneworld alliance. Using its partnership with Qatar",
            "Over September and October, around six million people visit Munich for Oktoberfest each year. However, due to the",
            "Travel corridors are starting to open up again, and passenger numbers are heading in the right direction across",
            "All Airbus aircraft are presently certified to fly with up to a 50% blend of sustainable aviation fuel",
            "Boeing has marked ten years since delivering the first 787 Dreamliner to a customer. The next-generation widebody has",
            "Adelaide is emerging as a clear winner after Qantas launched a swathe of new routes from the South",
            "Nearly 18 months after axing all their international flights, Virgin Australia is resuming some short-haul international flying over",
            "With Air India receiving final bids for privatization on September 15th, everyone is curious to know who will",
            "Almost 500 non-local Cathay Pacific pilots have had their work permit applications knocked back by Hong Kong’s Immigration",
            "Air Senegal is the flag carrier for the West African country of Senegal. From its hub at Blaise Diagne",
            "Nearly 18 months after axing all its international flights, Virgin Australia is resuming some short-haul international flying over",
            "The British-built VC10 was a long-range quadjet introduced in 1964. Only 54 were built, and they served with",
            "Today, September 27th, the Qantas Group updated its flying schedule to fit with the reopening plans and latest",
            "Dubai-based carrier Emirates will add 11 Airbus A380 destinations to its growing network by the end of November.",
            "The man who spectacularly glued himself to the top of a British Airways aircraft two years ago has",
            "Like any other business, an airline is – or should be at least – set up because of",
            "Despite last week’s Airbus Summit in Toulouse primarily covering sustainability goals, the aviation powerhouse also touched on other",
            "An escaped tortoise caused chaos at Tokyo’s Narita airport when one of the runways was closed for 12",
            "Before becoming a general manager and then CEO of Eastern Airlines, Edward &#8216;Eddie’ Rickenbacker had an incredibly fascinating",
            "The third of three Airbus A350 aircraft bound for the German government has taken its first flight in",
            "It has been three months since Ryanair’s first MAX 8 – called the &#8220;MAX 200&#8221; – entered commercial",
            "Incentivized by trade sanctions imposed by the US, Russia’s aero-engine industry has entered an era of revival. With",
            "Like any other business, an airline is usually set up because of a clear problem that it is",
            "Earlier today, Beijing Daxing welcomed its 20 millionth passenger of 2021 so far. According to reports, the lucky",
            "Some of the longest flights we’ve witnessed come from carriers like Singapore Airlines, Qantas, Qatar Airways, and Emirates.",
            "Airbus has set itself an ambitious target to introduce the world’s first zero-emission commercial aircraft by 2035. There",
            "There are over 75,000 flights scheduled on September 27th. While narrowbodies naturally have the bulk of flights (70%),",
            "The transatlantic market has been a shadow of its former self for a little over 18 months. So",
            "Embraer’s return to the turboprop market is an interesting move, but one which could solve a number of",
            "LOT Polish Airlines launched flights to Dubai yesterday, competing with the double-daily service that flydubai and Emirates offer",
            "Ecuatoriana Airlines is set to start flying during the firsts months of 2022, according to the latest reports",
            "Two men are facing jail time after allegedly conspiring to defraud multiple airlines through false lost luggage claims.",
            "As Australia’s biggest states start to chart their way out of lockdown paralysis, Qantas is responding by rebooting",
            "One of China’s newest jets, the C919, remains under development. However, the aircraft is facing a new set",
            "AirAsia X has booked a massive US$5.9 billion loss for the three months ending June 30, 2021. It",
            "On Monday, Alaska Airlines received the first of 13 new Boeing 737 MAX jets from Air Lease Corporation",
            "Indian skies will soon see some more Boeing 737 MAX action as LCC SpiceJet prepares to bring back",
            "International flying to and from Asia remains in the doldrums and lagging other regions, but American Airlines sees",
            "Not to be confused with Air Nostrum, which operates as a franchisee of Iberia providing domestic flights within",
            "Dubai-based carrier Emirates has penciled in a date to resume the second of three pre-pandemic routes to the",
            "The idea of a ‘combi’ aircraft, capable of shifting significant amounts of cargo as well as a good",
            "Miami has regained its sole non-stop passenger route to Africa, a continent not especially associated with the South",
            "It will once again be possible to fly around the world with Singapore Airlines as the airline is",
            "Qatar Airways confirmed that it had taken an impairment on all ten of its Airbus A380 aircraft in",
            "Testing for coronavirus has become a key aspect of air travel during the ongoing pandemic. While this measure",
            "In preparation for American’s return to India, it has announced a new codeshare partnership with IndiGo. India’s largest",
            "While Ryanair may have pulled back from its negotiations with Boeing for the 737 MAX 10 due to",
            "Welcome to our ninth routes newsletter, full of the latest colorful photos of new routes. Like what you",
            "South African Airways (SAA) and Kenya Airways have announced they are in talks over forming a pan-African airline.",
            "Aircraft leasing is a key way of allowing airlines to operate their desired services without requiring the commitment",
            "In an exclusive webinar interview with Simple Flying, American Airlines confirmed plans to be the most loved airline",
            "KLM has put Amsterdam to Las Vegas and Miami back on sale, with both resuming on December 7th",
            "airBaltic has started Riga to Dubai, the world’s second-longest A220 route this month after the carrier’s service to",
            "February 2022 will mark 40 years since the first flight of Boeing’s famous 757 family. The US planemaker",
            "Finnair has undertaken the biggest single aircraft financing transaction in its history. The airline revealed today that it",
            "A Southwest Airlines flight between Santa Ana and Phoenix ran into a spot of bother on approach to",
            "Emirates has outdone itself with its latest special livery. The airline is no stranger to painting its jets",
            "Until last year, Qantas’s most distinctive aircraft were arguably its double-decker Airbus A380 &#8216;superjumbos.’ Of course, the onset",
            "On December 3, 2021, Avianca will launch a new route connecting Bogota to Toronto nonstop in six hours.",
            "United Airlines is teaming up with Johannesburg-based Airlink, offering a codeshare arrangement that will offer one stop connections",
            "After an absence of close to two years, Jetstar Asia is to resume flying between Singapore and Darwin",
            "The Federal Aviation Administration (FAA) with the National Aeronautics and Space Administration (NASA) has announced that it has",
            "Air New Zealand updated its international timetables on Tuesday to cover December and the first quarter of 2022.",
            "Frontier Airlines is embarking on another round of expansion. This time, Cancun, Mexico, and Tampa, Florida, are the",
            "For the first time in India, airlines and air navigation service providers have been asked to test employees",
            "Canada has lifted a ban on direct flights from India after high COVID-19 cases in the subcontinent saw",
            "United Airlines is teaming up with Johannesburg-based Airlink, forming a codeshare arrangement that will offer one stop connections",
            "The decline of any major airline rarely happens overnight. One has to look back several years, sometimes decades,",
            "Air France’s new and first Airbus A220-300 is coming home. The airline is ready to take delivery of",
            "Lufthansa has seen ticket sales to the United States boom following the country’s announcement that it will relax",
            "There are short turboprop cross-border flights lasting no longer than a take-away coffee. Then, there is the world’s",
            "Air France has taken delivery of its first Airbus A200 aircraft. The airline became the second French carrier",
            "After closing its Cork base in October 2020, Ryanair has confirmed that it’ll reopen with two based B737-800s",
            "As corporations in the United States continue to mandate that all staff get vaccinated, nearly 600 employees at",
            "12 years ago today, a British Airways Airbus A318 took to the skies from London City Airport. The",
            "The A380 may have had a much too premature exit from many fleets, its demise sped up by",
            "Southwest Airlines has partnered with Disney World on a commemorative co-branded Boeing 737-700 to mark the 50th birthday",
            "The Boeing 737 MAX has successfully completed its test flights in China, according to the manufacturer’s China President.",
            "Air France has taken delivery of its first Airbus A220 aircraft. The airline became the second French carrier",
            "If you’ve ever enjoyed the extra legroom available in the exit rows of an airplane, you might have",
            "The remaining days for Lufthansa Cargo’s only remaining MD-11F are incredibly numbered, as the airline took delivery of",
            "Birds have a history of plaguing operations at airports around the world, but now Amsterdam Schiphol Airport (AMS)",
            "Startup long-haul low-cost airline Norse Atlantic Airways has disclosed an initial three routes to the US. All are",
            "One of the strongest representations of an airline’s brand is its aircraft and the bold livery that they",
            "Today, LATAM Airlines Group announced that it obtained committed financing of up to US$750 million as part of",
            "JetBlue announced today that it would be accelerating its transition to sustainable aviation fuel by purchasing over $1",
            "The Airbus A220 could be an aircraft that serves the Latin American market well, despite the fact that",
            "Another startup in the United States is getting ready to launch operations in less than a month. ExpressJet",
            "A US Senator has proposed a bill that would require passengers to prove their COVID-19 status before boarding",
            "American Airlines is looking forward to a post-crisis world where international flying comes back strong. Already thinking to",
            "Substantial waves of the COVID-19 Delta variant across New South Wales and Victoria over the recent southern hemisphere",
            "When news of former Jet Airways CEO Vinay Dube’s plans of a new startup airline started doing the",
            "Airline travel around the Asia-Pacific region remains significantly down on pre-pandemic levels. International passenger numbers in the region",
            "JetBlue has arrived at London Gatwick Airport. Today, the hybrid US carrier launched its newest flight connecting New",
            "British Airways has extended its short-haul widebody program into October. The airline will be flying Boeing 787 Dreamliners",
            "Once upon a time, travelers could fly directly from Frankfurt to Pune on a narrowbody Boeing 737, enjoying",
            "Japanese carrier All Nippon Airways is finally set to take physical delivery of its last Airbus A380. The",
            "easyJet currently has 322 aircraft at Group level across easyJet UK, easyJet Europe, and easyJet Switzerland. It has",
            "Japanese airline ANA is taking a novel approach to encouraging its passengers to get vaccinated by offering free",
            "As the dust settles on Air France’s first A220 arrival, the selection of WiFi provider for the new",
            "You can get a return from London Gatwick to Lanzarote for just £17.98 return all-in, with block time",
            "Virgin Atlantic plans to delay its initial public offering (IPO) until early 2022, with the airline instead focusing",
            "You can get a return from London Gatwick to Lanzarote for just £17.98 return all-in, with a block",
            "Dusseldorf Airport and its spotters had an unexpected surprise on Monday. Eurowings Discover unexpectedly operated its first flight",
            "More than ever, airlines are turning to digital solutions to adapt to the changing conditions in aviation. Etihad",
            "Qatar Airways is finding more uses for its Airbus A320 fleet. The airline is adding a new Egyptian",
            "This morning, all flights departing from Paris-Orly and Paris Roissy-Charles de Gaulle airports were suspended for around 30",
            "London Gatwick to Lanzarote can be had for just £17.98 return, with a total block time – there",
            "This week, the Federal Aviation Administration (FAA) announced special conditions for airworthiness standards of electric propulsion systems in",
            "There are 2.4 million non-stop flights planned in October, with 361 million seats available for sale. The A320ceo",
            "Smartwings, the low-cost Czech airline, has today launched its first flights to London’s busiest airport &#8211; Heathrow. The",
            "Italia Trasporto Aero (ITA) has today proudly announced a Memorandum of Understanding (MoU) with Airbus to acquire 28",
            "American Airlines believes its core hub strategy and the connectivity it offers will provide the carrier with a",
            "The South American carrier Avianca expects to achieve a total capacity recovery during 2022’s second quarter. Slowly but",
            "American Airlines has recently signed partnerships and announced massive investments in Chile’s low-cost carrier JetSMART and Brazil’s operator",
            "The National Transportation Safety Board (NTSB) will attempt to retrieve the wreckage of a Boeing 737 that ditched",
            "United’s pool of unvaccinated employees is shrinking fast as the airline begins the process of terminating unvaccinated employees.",
            "Embattled Thai Airways continues with its business rehabilitation plan, on Thursday posting a progress report to the Stock",
            "The Taliban has formally communicated with India, asking for a resumption of flights between the two countries. Details",
            "Italia Trasporto Aero (ITA) has today announced a Memorandum of Understanding (MoU) with Airbus to acquire 28 new",
            "On September 30th, Etihad Airways unveiled three new destinations for its upcoming winter season. These three quarantine-free spots",
            "In the last year and a half, American Airlines hasn’t utilized Heathrow International Airport as a connective hub",
            "Flying Blue is the frequent flyer program for Air France-KLM and has around 18 million members around the",
            "Singapore Airlines is set to scrap two of its previously retired Airbus A380 aircraft in its home city.",
            "Emirates is the world’s 13th-largest international airline on October 1st, 2021, if measured in total flights. And it",
            "The long-running battle to sell off Air India is drawing closer to a close. Reports in media today",
            "In a curious sequence of events, police in Miami detained an American Airlines passenger earlier this week after",
            "It’s natural for any adventurous spirit to want to explore an old aircraft &#8211; probably more so if",
            "It makes sense that French national airline Air France should be one of Airbus’ best customers. While the",
            "Vueling has announced 28 routes from Paris Orly, each beginning in early November, adding to the 20 it",
            "A Kalitta Air Boeing 747 cargo aircraft has been snapped emitting an impressive burst of flame from the",
            "The Bombardier CRJ series of regional jets can be found operating feeder flights all over the world. Bombardier",
            "The world’s largest plane has a busy week in store. Following a flight to Almaty in Kazakhstan today,",
            "Vueling has announced 28 routes from Paris Orly, each beginning in early November. Another four – currently unknown",
            "Air Force One is perhaps the most easily recognized aircraft in the world. But it is not one",
            "The USA has nearly 2,000 domestic widebody flights this week, a whopping 84% more than the same week",
            "Sustainable Aviation Fuel (SAF) has been a hot topic in the aviation industry in recent years. While there",
            "In recent years, quadjets like the Airbus A340 have become an increasingly rare sight. Philippine Airlines is just",
            "Last week, we revealed details about the Airbus A350’s dimmable windows, highlighting what we can expect from the",
            "Lufthansa is today bringing back the Boeing 747-400 after 18 months of not using the type. The airline",
            "United Airlines has now integrated vaccine verification into its mobile application. This development will benefit travelers whose itinerary",
            "It is the second anniversary of Adria Airways declaring bankruptcy, although the airline’s bankruptcy was in the making",
            "Since 2018, the Mexican Government has had its presidential aircraft (registration XC-MEX) parked and stored while trying, unsuccessfully,",
            "American Airlines is the latest airline to announce its employees will need to be vaccinated to work for",
            "Alaska Airlines has unveiled its newest livery celebrating the San Francisco Giants – the major league baseball team",
            "This past week, a greyhound rescue had the experience of a lifetime when he was allowed to fly",
            "The International Air Transport Association (IATA) has called on the South African government to support the air transport",
            "German low-cost carrier Europwings has just announced that it is launching a new service connecting the Elbe River",
            "Last month, Airbus reported that it had a backlog of nearly 500 A220s on order. With the planemaker’s",
            "In a statement from its Tourism Authority issued on September 30, 2021, the Dutch  Caribbean island of Aruba",
            "Airbus has been focusing heavily on hydrogen solutions, looking to introduce the first zero-emission commercial plane by 2035",
            "Royal Jordanian Airlines is planning to resume its flights to Syria. It has been almost a decade since",
            "Since 2018, the Mexican government has had its presidential aircraft (registration XC-MEX) parked and stored while trying, unsuccessfully,",
            "At the end of August, what would become Air France’s first Airbus A220 conducted its maiden flight. Moreover,",
            "Next month will mark 29 years since the Airbus A330 made its first flight, in November 1992. The",
            "In recent years, Ethiopian Airlines has become one of the key players of African commercial aviation. It operates",
            "Carriers are increasingly mandating that staff members be vaccinated amid the coronavirus pandemic. Yesterday, we reported that American",
            "The Airbus A330 series is a key part of TAP Air Portugal’s long-haul operations. Although the Portuguese flag",
            "While critical progress has been made in the return of air travel this year, the aviation industry is",
            "Delta Air Lines is adding new routes from Boston Logan International Airport (BOS) in 2022 in a bid",
            "Aeromexico has filed its reorganization plan under its Chapter 11 bankruptcy filing. As the airline prepares to come",
            "If there is an interesting market on American’s radar, it is India. The carrier is set to return",
            "People that have flown in and out of Trinidad and Tobago in recent years are likely to be",
            "One of the first clear policies of its kind, Air New Zealand, will require its international passengers to be vaccinated",
            "Today, October 3rd, Air New Zealand unveiled its policy requiring all passengers on its international flights to be",
            "The European Commission has secured commitments from several of the continent’s leading airlines that will see passengers receive",
            "Riga International Airport (RIX)-based airBaltic has just welcomed the 32nd Airbus A220-300 to its fleet of aircraft. In",
            "October is now upon us, and it’s time for this month’s first weekly digest. The last seven days",
            "A Spirit Airlines Airbus A320neo had to abort its takeoff from Atlantic City yesterday after experiencing a bird",
            "Spanish national flag carrier Iberia and Mexico regional airline Aeromar are pleased to have renewed their interline agreement",
            "Yesterday marked four years since the collapse of Monarch Airlines. Monarch was a UK-based scheduled and charter airline",
            "Virgin Atlantic has resumed its flights to San Francisco from London Heathrow. The move comes after an announcement",
            "Major figures in aviation are keen to transform the industry to operate in a net-zero ecosystem by the",
            "The airline recovery is continuing in the United States. After a rise in cases and hospitalizations associated with",
            "The first Egyptair flight to Cairo from Tel Aviv landed at Ben Gurion Airport today. This touchdown symbolizes",
            "In the modern era, cloud computing is as standard as an Excel spreadsheet in many industries. However, when",
            "Boston Logan International Airport (BOS) is one of Delta’s fastest-growing hubs. Next year, as it expects demand to",
            "With Australia announcing it will begin re-opening its international border from mid-November, Qantas has said it will bring",
            "American Airlines has a prolific array of partners around the world. This includes members of the oneworld alliance, like",
            "Beyond the big busy Australian domestic trunk routes, there is a bustling world of regional flying. But it",
            "It takes a lot to shock commuters in Delhi – crawling peak hour traffic, road rage, incessant honking",
            "After deferring a decision for over a year, Qantas is once again talking to aircraft manufacturers about buying",
            "On October 1st, Icelandair announced that it had partnered with the firm Aviation Capital Group (ACG) to secure",
            "With cold weather fast approaching to many parts of Europe, Lufthansa hopes to fill its aircraft with leisure",
            "While the government is yet to confirm the decision, reports have emerged that the Tata Group is the",
            "The Lufthansa Airbus A350-900 fleet is set to get bigger slightly ahead of schedule with the lease of",
            "Ukraine’s SkyUp Airlines is changing up its uniform. Following a worker survey, heels will no longer be a",
            "easyJet has revealed Jordan as its next country in the Middle East. With eight routes across Europe announced,",
            "Embraer’s forthcoming turboprop is set to reinvent the way the world views this type of air transportation. Taking",
            "British Airways is rumored to be planning Airbus A380 flights to both Frankfurt and Madrid next month, according",
            "Speaking at an event in Dubai, the senior vice president for Emirates Group Security predicted that passengers should",
            "Delta Air Lines is reporting stabilizing market conditions as it moves into the third quarter. As such, it",
            "After an 18-month pause, Etihad is resuming cabin crew hiring. The Abu Dhabi-based carrier plans to hire 1,000",
            "As the latest James Bond movie hits screens worldwide, we explore what routes use the 007 flight number",
            "The airfreight market is set to double in value over the coming twenty years &#8211; and aircraft lessor",
            "The Lufthansa Group plans to use electricity to generate sustainable aviation fuels (SAFs), where the carbon comes from",
            "SpiceJet has delayed the planned return of service of the Boeing 737 MAX, which was scheduled for tomorrow.",
            "IATA has today released its latest market outlook for the global aviation industry. IN total, it forecasts that",
            "The UK’s TUI Airways retired its last Boeing 757-200 today, October 4th. While the withdrawal of the type",
            "Many airlines have already committed to net-zero emissions by 2050. Following IATA’s annual meeting on Monday, there is",
            "Spanish flag carrier will celebrate a century of operations later in the decade, having first taken to the",
            "LOT Polish Airlines continues to voice its dissatisfaction with Boeing about the grounding of the Boeing 737 MAX",
            "The UK’s TUI Airways retired its last Boeing 757-200 on October 4th. While the withdrawal of the type",
            "The Virgin Group is a far-reaching conglomerate with its fingers in many pies. Among these over the years",
            "Following an Executive Order issued by the federal government, requiring that all federal contractors have their staff vaccinated",
            "The Colombian carrier Avianca and the Chilean low-cost operator Sky Airline could be planning to merge under one",
            "A supplier to Boeing has let the cat out of the bag about 787 Dreamliner production numbers. Alessandro",
            "Southwest Airlines has become the latest carrier to announce its employees will need to be vaccinated to keep",
            "Following an Executive Order issued by the federal government requiring that all federal contractors have their staff vaccinated",
            "Qantas and Emirates are extending their long-standing partnership for a further five years. Both airlines call the tie-up",
            "The Transportation Security Administration (TSA) has granted Vietnam Airlines clearance to operate scheduled commercial flights from Vietnam to",
            "Time has flown by since Flybe ceased to exist over one and a half years ago in March",
            "Today, the Lufthansa Group revealed that it had returned to profit for the third quarter of 2021, with",
            "Former President Donald Trump’s personal Boeing 757 has taken to the skies again after five years on the",
            "Officially called Adolfo Suárez Madrid–Barajas Airport (MAD) but more commonly known as Madrid Barajas Airport, it is the",
            "We are used to seeing images of aircraft being used to fight fires. Every year, there are a",
            "Vistara has gone from a startup to a major carrier in just six years. Owned by Tata and",
            "A joint FAA and FBI investigation into the infamous &#8216;Jetpack Man’ of Los Angeles has concluded that inflatable",
            "Finnair has made a name for itself from comfortable connections between cities in Europe and Asia via its",
            "With just five days to go until British Airways resumes Airbus A380 flights, the airline is putting the",
            "Designed by the Hughes Aircraft Company, the Hughes H-4 Hercules, commonly known as the Spruce Goose, made its",
            "Explosive decompression can be a very dangerous phenomenon in the domain of aviation. These events see air pressure",
            "Established in 2005, Juneyao Air has successfully carved a space for itself in the highly aggressive and competitive",
            "Dubai to London Heathrow is the world’s number-one route in November if measured by available seat miles. Distance,",
            "British Airways has added Airbus A380 flights to Johannesburg to its schedule from January 10th. As things stand,",
            "Officially called Adolfo Suárez Madrid–Barajas Airport (MAD) but more commonly known as Madrid Barajas Airport, this is the",
            "Widebody aircraft are typically associated with multi-class seating configurations featuring business class flatbeds. However, certain carriers have taken",
            "Ryanair has Boeing 737 MAX flights scheduled to over 100 airports during November from Agadir to Zaragoza. Just",
            "Kuwait-based Jazeera Airways is reportedly weighing up placing a large aircraft order within weeks, with the tentative announcement",
            "In another sign of Australia warming up to international travel, the country has recognized India’s Covaxin for establishing",
            "Only 15 years old, Hong Kong International Airport has forged its place as one of the busiest and",
            "A Russian agency is running a vaccine tourism scheme to Croatia for Russians to get vaccinated in this",
            "Turkish Airlines announced on Wednesday its intention to add scheduled commercial service to Seattle-Tacoma International Airport (SEA) and",
            "The Colombian carrier Avianca is now one step closer to emerging from its restructuring process under the Chapter",
            "Over the last three decades or so, Asiana Airlines has established itself as a key player in South",
            "Beijing Capital International has consistently been one of the world’s busiest airports, even ranking second until recently. A",
            "Western Sydney Airports appears on track for its projected 2026 opening after already shifting 20 million cubic metres",
            "Alaska Airlines has expanded its codeshare agreement with British Airways. Adding 16 new Alaska-operated routes, the expanded agreement",
            "For the first time in its 70 year history, Fiji Airways is putting a woman in command of",
            "Israel’s El Al Airlines flight from Bangkok to Tel Aviv had to be diverted to Goa, India following",
            "AirAsia wants to start flying dedicated freighters as it diversifies away from its core low-cost passenger operations. Reports",
            "As Air India quickly nears privatization, government agencies are coming forward for their dues. One huge lender to",
            "Sheremetyevo International Airport is the largest of Moscow’s four airports and is located in Khimki, 29 km northwest",
            "Ryanair is renowned for fast growth and for introducing – and cutting – large numbers of routes. The",
            "Emirates has revealed that it plans to launch daily flights to Tel Aviv in December. The new route",
            "The world of commercial aviation is one driven by a strong commitment to safety. This has led regulatory",
            "American Airlines is the world’s largest airline in 2021 when measured in flights, seats for sale, and available",
            "According to the final customer, Atlas Air, Boeing is expected to deliver its last 747 next October. Just",
            "Since commencing flights in 1996, WestJet has grown to become Canada’s second-largest airline with over 100 destinations in",
            "In April 2019, TAP Air Portugal took delivery of its first Airbus A321LR. This plane has been pushing",
            "In the long-running battle for the most delivered aircraft, is Boeing or Airbus winning? Boeing obviously launched the",
            "After establishing an information sharing mechanism with the Justice Department, the Federal Aviation Administration (FAA) has referred over",
            "The newest generation of mobile connectivity, 5G, is undergoing a change. On December 5th, new services will begin",
            "German flag carrier Lufthansa is now operating daily Boeing 747-400 flights from its Frankfurt home. Following a quiet",
            "Ravn Alaska plays a crucial role in connecting small communities across its home state. The Anchorage-based airline holds",
            "Alaska Airlines has announced and put on sale its next destination in Florida: Miami. Starting in June, the",
            "As Finnair is relaunching services between Helsinki and the two nearby destinations of Turku and Tampere, it is",
            "Boeing has produced over 10,000 aircraft from its popular 737 series, with several different sub-families. One of these",
            "As Australia relaxes its strict COVID-19 related border measures, airlines are looking to add capacity on their routes",
            "Air Canada’s CEO has received backlash for his lack of French abilities this week. The leader of the",
            "Norwegian regional airline Widerøe has a colorful and fascinating history. Stretching back almost 90 years, the airline grew",
            "Despite the COVID-19 pandemic, American Airlines has been growing strong in the Latin American and Caribbean regions. According",
            "After establishing an information-sharing mechanism with the Justice Department, the Federal Aviation Administration (FAA) has referred over three",
            "Even in recent memory, the technology available to pilots of commercial aircraft has come a long way. Cockpit",
            "A campaign to increase COVID-19 vaccination rates in and around Nashville has received a boost after American Airlines",
            "In less than 20 years, Jetstar has gone from a concept to one of the world’s most successful",
            "The days seem numbered for Johannesburg-based Mango Airlines after sole shareholder South African Airways and its owner, South",
            "Despite still being in its teenage years, Vueling has grown quickly to become Spain’s largest airline in terms",
            "A section of Indian LCC SpiceJet staff, who had gone on strike on November 1st, called off the",
            "In just a few weeks, Kenya Airports Authority (KAA) will be auctioning off a long list of aircraft",
            "On October 31st, a Boeing 737-900BBJ operated by the Kuwaiti government experienced a tail strike while taking off",
            "Pakistan has revoked overflight rights for GoAir’s new service from Srinagar to Sharjah less than two weeks since",
            "The heir to now-folded Italian flag carrier Alitalia, ITA Airways, inaugurated its first long-haul service on Thursday. The",
            "There is just one Ilyushin 96 in active commercial service anywhere globally, and it is with Cubana. More",
            "Sony’s rare PlayStation 5 is being flown to the UK in droves with the help of Korean Air.",
            "Lufthansa may be mulling over plans to purchase additional Airbus A220 aircraft for its group. The European conglomerate",
            "Next month the Qatar Airways Airbus A380 will return to the skies. However, it seems as though the",
            "Having stated that it would not return the 737 MAX to its fleet, Norwegian has indicated that it’s",
            "The B767-400ER is United Airlines’ least used aircraft this year after a handful of planes came out of",
            "Alaska Airlines no longer has an order for 30 Airbus A320neo aircraft on the books. Airbus released updated",
            "Lufthansa is one of the largest airlines in the world, with numerous subsidiaries covering the whole aviation spectrum.",
            "After years of delay to the program caused by sanctions, the Russian-built narrowbody jetliner MC-21 is now on",
            "The Brazilian OEM Embraer is on pace to deliver nearly 150 aircraft in 2021, according to the company’s",
            "As Emirates increasingly deploys the A380 to more and more airports globally, an inevitable question arises: where won’t",
            "Qantas appears to be expecting an early arrival of the Airbus A380 back in Australia. While the airline",
            "Eurowings announced it would start cooperating with Smartwings in Prague Airport despite the fact that Eurowings is owned",
            "It has now been 84 years since the Hindenburg disaster. This accident was one is one of the",
            "The Colombian civil aviation authority (Aeronáutica Civil) has approved 65 new routes to the local low-cost carrier Viva.",
            "Air Lease Corporation (ALC) has reported that demand for narrowbody aircraft has come back strong at or above",
            "The Saab 2000 was a larger development of the earlier Saab 340, with the Swedish manufacturer producing just",
            "IAG is on a steady path to recovery, offering its outlook for 2022 in its Q3 2021 earnings",
            "Present times excluded, Ryanair is the world’s largest international airline. With 79 bases across Europe and North Africa,",
            "As the United States prepares to reopen its borders on Monday, the Irish national flag carrier is reporting",
            "On November 2nd and November 4th, a Hi Fly Airbus A340-300 operated two trips to Antarctica from Cape",
            "Spanish national flag carrier Iberia and Spanish energy and petrochemical company Repsol have partnered to make the first",
            "At the 2019 Paris Air Show, it was announced that Cape Air would add the Eviation Alice electric",
            "In a statement released on November 2, 2021, American multinational conglomerate logistics and shipping company FedEx Express said",
            "As the United States prepares to reopen its borders on Monday, the Aer Lingus is reporting that it",
            "This Friday marked the 16th anniversary of the Indian low-cost carrier Go First (formerly known as GoAir). The",
            "Airlines operating in the United States have been keeping a close eye on the calendar ahead of November",
            "On November 1, the Argentinian Government opened the border for fully vaccinated international travelers. After more than one",
            "Avianca is one of the oldest active commercial carriers in the world. In fact, it is the second",
            "While most people affiliate Fiat with ground vehicles, it once had a strong hand in Italian aviation. During",
            "Wizz Air UK has been making significant strides over the last year. The carrier announced a series of",
            "The Air Line Pilots Association, International (ALPA) has raised some concerns about Waltzing Matilda Aviation’s plans to create",
            "Alaska Airlines has plans to fly a total of 30,901 flights this month. With just under four million",
            "American Airlines is looking to shore up its operations this holiday season. As a result, it is upping",
            "American Airlines has delayed the launch of its Dallas – Tel Aviv and Seattle – Bangalore flights. Citing",
            "The parent company of Japanese carrier ANA, ANA Holdings, has signed a memorandum of understanding (MoU) with Virgin",
            "Flying out of hubs in Dammam, Jeddah, and Riyadh, Saudia boasts an impressive fleet of more than 150",
            "VietJet has announced its plans to take its first steps into the widebody market by operating three leased",
            "One of the busiest airports in Spain, Palma de Mallorca Airport (PMI) was temporarily shut down yesterday for",
            "This edition of our weekly Sunday Reads article marks the 33rd iteration of the digest overall, and the",
            "Since the onset of the coronavirus pandemic, British Airways’ operations at London Gatwick Airport have been a hot",
            "After having undergone several changes to its fleet, including the retirement of all its Dash 8 turboprops, we",
            "One of the busiest airports in Spain, Palma de Mallorca (PMI), was temporarily shut down yesterday for four",
            "LOT Polish Airlines is one of the oldest continually operating airlines in Europe, and indeed the whole world.",
            "The day is almost here! On November 8th, the US will open its border to fully vaccinated travelers",
            "TAP Air Portugal prides itself on being the national carrier of its country. Along with transporting passengers to",
            "Japan Airlines has been in operation for over 70 years, and served as the country’s flag carrier for",
            "Wright Electric this week announced the launch of the Wright Spirit. The Los Angeles-based startup is looking to",
            "Filing schedules this weekend, United Airlines has made some significant cuts to its regional network. Several smaller destinations",
            "Even when sitting in the most comfortable seats available in the aircraft cabin, it’s hard to receive balanced",
            "After years of benign neglect, Qantas is beginning to show Newcastle some love. Newcastle is the second-largest city",
            "Monday will mark a turning point in the recovery. American Airlines is preparing to welcome back the travelers",
            "In less than 40 years, Guangzhou-based China Southern Airlines has grown into a global juggernaut. With a fleet",
            "As air travel in India continues to be on an upward trajectory, the country’s largest no-frills airline, IndiGo,",
            "One of the quiet achievers of the aviation business, ATR, has just turned 40. From humble beginnings, the",
            "Fast approaching its 30th anniversary, Russian carrier S7 Airlines and its fleet might be best recognized for its",
            "As of today, Monday, November 8th, vaccinated international travelers will be able to travel to the United States.",
            "After a tumultuous 2021, the burgeoning Indian domestic market has made a significant recovery. The last month has",
            "British Airways and Virgin Atlantic are typically rivals. However, today the two airlines put their differences between them",
            "Indian carrier Vistara has successfully inaugurated a new long-haul route, having operated its first commercial service to Paris",
            "Emirates today announced that it signed a Memorandum of Understanding (MoU) with Garuda Indonesia to form a codeshare",
            "Today is the day that most fully vaccinated Europeans can travel without restriction (except a negative COVID next)",
            "This morning, British Airways returned the Airbus A380 to the skies. With a flight from London Heathrow Airport",
            "Having taken on a new registration several weeks ago, a 10 year old Boeing 747-8 has taken its",
            "SpiceJet is offering passengers the chance to pay for their tickets in installments instead of upfront. Now, passengers",
            "In an announcement today, US-based Viasat has revealed its intentions to buy UK-based satellite communications company Inmarsat in",
            "It might be hard to believe, but there is only one route anywhere in the world that will",
            "British Airways and Virgin Atlantic are typically rivals. However, today the two airlines put their differences aside as",
            "On Monday, Brazilian aircraft manufacturer Embraer unveiled four new sustainable aircraft concepts. Meant to enter service over a",
            "Qantas is ferrying an Airbus A380 from Germany to Sydney ahead of the type’s return to service. The",
            "A group of Nigerian MPs have filed a sizable claim against carrier Azman Air. The MPs are asking",
            "British Airways was the world’s 18th largest airline by flights in 2019, the last normal year. It has",
            "Earlier on Monday, Air France’s second Airbus A220 was on its way to Nantes when it diverted back",
            "The United Kingdom has always been an essential market for Wizz Air. The company’s first flight was from",
            "TAROM retired its two remaining Boeing 737-300 aircraft from service today. The last scheduled flight with a 737-300",
            "After more than ten months, LATAM Airlines Group is finally reinstating its connectivity between the United Kingdom and",
            "After nearly two years of closed borders and travel restrictions, the United States re-opened to fully vaccinated travelers",
            "Connect Airlines, which wants to use turboprops to connect Toronto with major cities in the United States, is",
            "A takeover bid for Sydney Airport faces a final hurdle as Australia’s competition watchdog, the Australian Competition and",
            "As the US reopens for travelers from Europe, Delta is celebrating with an expanded 2022 transatlantic flight schedule.",
            "While airlines now commonly ask passengers to present proof of their vaccination status before boarding international flights, few",
            "Even as domestic air traffic in India shows signs of recovery, it’s still not quite the same as",
            "On Monday, regional Japanese carrier Air Do (formerly Hokkaido International Airlines) unveiled a brand new aircraft livery. Dressing",
            "South African Airways (SAA) has been South Africa’s flag carrier since the 1930s. Over its nearly 90 years",
            "Boeing has flown the 777X out to Dubai ahead of its public debut at the Dubai Airshow. Having",
            "The Sukhoi Superjet 100-95 (SSJ100) took off commercially with Armavia 10 years ago in 2011. Despite reported maintenance",
            "Toulouse is well-known as a center for aerospace. However, it is more than just home to manufacturers like",
            "This week, Spirit has cut 9% of its January flights. The reason: the continuing staffing problem. Because of",
            "Kuwait Airways has revealed it is in talks with planemaker Airbus to amend its outstanding order. The Middle-Eastern",
            "The de Havilland DH.106 &#8216;Comet’ series is famous for having been the world’s first-ever commercial jet-powered airliner. The",
            "airBaltic’s Airbus A220s have carried more than 6.5 million passengers since the type’s introduction five years ago in",
            "As the pandemic rolled out over the globe, the relevance of the Airbus A380 was put into question.",
            "Earlier this year, Collins Aerospace launched a new, state-of-the-art flight control computer known as Perigon™. Boasting 20 times",
            "United will remove nine smaller cities from its route map in the early new year, based on the",
            "US aerospace manufacturer Boeing is one of the best-known names in all of aviation. The Chicago-headquartered company employs",
            "A Boeing 747 carrying cargo to Hong Kong delivered a little more than it expected this week. As",
            "Welcome to our 15th routes newsletter! Doesn’t time fly? This week includes a selection of the many routes",
            "This week, Spirit has cut 9% of its January flights. The reason: the continuing staffing problems. Because of",
            "Airbus has demonstrated how formation flying can aid sustainability with two test Airbus A350s flying across the Atlantic,",
            "The German commercial aviation scene comprises far more airlines than just flag carrier Lufthansa. Indeed, the country has",
            "United Airlines employees not willing to get vaccinated have been placed on unpaid leave unless granted an exemption",
            "The Brazilian carrier GOL Linhas Aereas is accelerating its transition into a Boeing 737 MAX fleet. According to",
            "The United States has reopened to the world &#8211; sort of. The United States is welcoming paid-up members",
            "After a 593 day absence, a Qantas A380 glided back into Sydney on Tuesday. The jet’s arrival precedes",
            "As COP 26 wraps up in the United Kingdom, aviation stakeholders have been left mulling over plans to",
            "German flag carrier Lufthansa has repaid in full its €9 billion ($10 billion) loan under the German government’s",
            "Narrowbodies have rarely had more than 10% of the winter North America to Europe market, and this winter,",
            "It has been nearly 11 months since the first B737 MAX took off in the United States following",
            "At Simple Flying, we’ve covered several transatlantic and transcontinental feats. Yet, there have also been numerous pioneering trips",
            "Azul Linhas Aereas believes the antitrust authorities in Brazil could be very favorable towards consolidation in the country;",
            "Earlier this week, Embraer revealed its vision of the future with the four-plane Energia family. With solutions embracing",
            "British Airways is set to wet lease an Embraer E190 from German Airways for CityFlyer operations out of",
            "Earlier this year, Airbus launched a much-anticipated freighter version of its newest widebody aircraft, the A350. Challenging Boeing’s",
            "ZIPAIR today shared that it will fly to Los Angeles from December 25th. This flight to the West",
            "Earlier this week, King County’s officials in Washington seized a former American Airlines Boeing B727-200 and scrapped it.",
            "Qatar Airways has dusted off its Airbus A380 ahead of its return to service next month. The airline",
            "Following a European Union diplomatic intervention as a result of the ongoing migrant crisis on the Poland-Belarus border,",
            "Scoot is coming to the UK. Starting just before Christmas, it’ll operate Singapore to London Gatwick via Bangkok,",
            "The Rolls-Royce UltraFan is set to be the biggest engine aviation has ever seen. Having started work on",
            "The CEO of Qatar Airways has consistently requested more support from all industry stakeholders to help aviation meet",
            "Friday evening marked a big occasion for American Airlines. The carrier officially inaugurated nonstop service between New York’s",
            "Indian low-cost giant IndiGo has seen its domestic capacity exceed pre-pandemic levels for the first time. The carrier",
            "United Airlines is adding capacity to Las Vegas McCarran International Airport (LAS) for CES 2022. The major tech",
            "United has put tickets on sale for its newest Middle Eastern destination. Flights to Amman, Jordan, from Washington",
            "There’s just one day to go until the 2021 edition of the Dubai Airshow opens its doors to",
            "Made possible with the use of carbon fiber material, the Boeing 787 Dreamliner’s wings have an incredible amount",
            "Doha-based Qatar Airways and China Southern Airlines are looking to build upon their existing codeshare agreement by signing",
            "When booking a trip, have you ever looked at the details of your flight and noticed the difference",
            "Irish low-cost carrier Ryanair has just announced that it is opening a new base at Agadir Al-Massira International",
            "Canadian leisure airline Air Transat has announced that for summer 2022, it will operate more than 250 flights",
            "The Lockheed L-1049 Super Constellation was a considerably influential aircraft following its introduction in December 1951. The plane",
            "Porter Airlines yesterday confirmed that it is finalizing the sale and leaseback of up to 19 Embraer E195-E2",
            "LATAM Airlines has been regaining its Brazilian network, and the carrier is currently operating 90% of the domestic",
            "The Mexican ultra-low-cost carrier Viva Aerobus is working towards having 30% of its fleet using novel and hybrid",
            "SpiceJet reported a ₹562 crore ($75.5mn) loss for the second fiscal quarter of 2021, reducing losses quarter-on-quarter but",
            "Airbus has shared today that it forecasts the need for 39,000 new-build aircraft over the next two decades.",
            "India has had its fair share of regional outfits over the decades. One of these carriers was Paramount",
            "Minneapolis-St. Paul International Airport (MSP) is a hub for two airlines. The giant Delta Air Lines has the",
            "The New York to Boston air market is an important one for business travelers. A high-frequency, high-demand route,",
            "Since the turn of the century, the German capital of Berlin has had a complicated relationship with its",
            "Despite having a larger collection of aircraft than major airlines like Air Canada or KLM, XiamenAir’s fleet of",
            "German low-cost carrier and Lufthansa subsidiary Eurowings is set to take a key step in modernizing its fleet",
            "A San Francisco-bound United flight diverted to Palm Springs yesterday after a threat of low visibility became evident",
            "Dubai International Airport (DXB)-based Emirates Airlines has announced that it is returning its flagship Airbus A380 service to",
            "Welcome back to Simple Flying’s weekly Sunday reads digest! Airlines and manufacturers have been busy preparing themselves for",
            "Boeing is set to increase its UK footprint by opening a new freighter conversion line at its existing",
            "While the first day of the Dubai Airshow started off slowly, it seems to be gathering pace. As",
            "Cayman Airways will relaunch its flights to New York’s John F.Kennedy Airport (JFK) on December 16, 2021. In",
            "While 2020 was a challenging year for airlines worldwide, it did see TAP Air Portugal reach 75 years",
            "Virgin Atlantic is one of four carriers flying on the competitive Delhi-London market. On a recent trip, Simple",
            "Southwest Airlines is offering incentives to its members of staff during the upcoming holiday season. The carrier is",
            "Romania’s flag carrier TAROM today signed a firm order to take on three ATR-72-600s. The Otopeni, Ilfov County-headquartered",
            "Today marked the opening of the 2021 edition of the Dubai Airshow. While the show got off to",
            "Honeywell is well known for its industry-leading solutions in technology for aviation. It is also well known for",
            "Frontier Airlines announced a major fleet expansion. With 91 more Airbus A321neos now coming from Airbus, the airline",
            "We recently shared that a network of vertiports could soon be introduced in the United Kingdom. This initiative",
            "Another week reveals another chapter of the Garuda Indonesia saga. Indonesia’s Deputy State-Owned Enterprises Minister told parliament last",
            "In June, Alaska Airlines raised eyebrows when it announced it was pulling out of the competitive and premium",
            "In just over 50 years, Seoul-based Korean Air has grown to become one of the biggest airlines in",
            "For its long-haul international flights, Air India relies on its fleet of Boeing 777s and 787 Dreamliners. Together,",
            "Monday is shaping up as a big day for Australia’s Regional Express (Rex). The airline is resuming Boeing",
            "Once the operator of dozens of Boeing 747s and a handful of Airbus A380 superjumbos, the fleet of",
            "American Airlines is seeing a strong response from the Indian market just days after starting its first route.",
            "On Sunday, November 14th, ATR, and Binter Canarias announced a firm deal for four ATR 72-600 aircraft with",
            "Sheffield is the second-largest city in the UK’s Yorkshire and the Humber region, and is well-served by air.",
            "All Cathay Pacific aircrew who passed through Frankfurt Airport (FRA) will have to undergo a 21 days quarantine",
            "Logistics giant DHL Express is set to expand its long-haul cargo fleet after ordering nine converted Boeing 767-300",
            "The world’s longest A319 route this week is a Russian domestic service, with the 3,021-mile (4,862km) link from",
            "Brazilian planemaker Embraer has booked its first order of the Dubai Airshow 2021. Today, the company has announced",
            "Emirates today shared that it has placed an order for two Boeing 777 Freighters. Announcing the deal at",
            "Aircraft leasing company ALC has placed the second large Airbus order of the 2020 Dubai Airshow. In doing",
            "Converted freighters have long been a popular and cost-effective way to build more cargo aircraft. As airlines order",
            "Rolls-Royce has signed an agreement with Silk Way West Airlines to re-engine the airline’s fleet of Boeing 747-400",
            "Earlier this year, Hong Kong’s flag carrier airline Cathay Pacific celebrated 75 years since its establishment in September",
            "American Airlines’ growth at Austin has been phenomenal. With 38 routes from the Texas capital this winter, including",
            "While Iberia and Vueling are dominant forces in Spanish commercial aviation, Air Europa’s role shouldn’t be overlooked. The",
            "Hungarian ultra-low-cost carrier Wizz Air has no plans to slow down. While at the ongoing Dubai Air Show,",
            "Virgin Atlantic could make a dramatic U-turn and return to Gatwick Airport (LGW) as early as next summer.",
            "Regional flying is a key part of US aviation. This market allows passengers from smaller airports to be",
            "Southwest is a conservative airline. It usually has added only a small number of airports each year, preferring",
            "Last week was a big week for Embraer’s sustainability department. The Brazilian planemaker launched four new aircraft concepts",
            "Aircraft leasing company ALC has placed the second large Airbus order of the 2021 Dubai Airshow. In doing",
            "Boeing today announced that Saudia has signed an agreement with the manufacturer to utilize a host of services",
            "The Spanish Ministry of Defence has acquired three Iberia Airbus A330s for conversion to an MRTT (Multi-Role Tanker",
            "Croatia Airlines launched its first-ever international route out of Osijek Airport in Croatia today, linking it to Munich",
            "While the world’s climate conscience and attention have been directed at Scotland over the past couple of weeks",
            "LATAM Airlines Group and Delta Air Lines have added more than 20 international routes to its codeshare agreement",
            "While the 2021 Dubai Airshow started slowly on Sunday, it quickly gathered pace on the second day. While",
            "Depending on how you spin it, Thai Airways International either posted a net operating loss of US$658 million",
            "The European Union is moving against airlines that maintain flights into Belarus after it launched a further round",
            "American Airlines filed some schedule cuts in New York over the past weekend. This has counteracted some of",
            "On the back of significantly improved and recently reported half-yearly results, Singapore Airlines continues to rebound from the",
            "Almost two years into the COVID pandemic, the global aviation market is beginning to pick up the pieces.",
            "In early November, I had the opportunity to try out the full flight simulator (FFS) of a Boeing",
            "Dubai-based Emirates has confirmed it will retrofit 105 of its widebody aircraft with premium economy seats. The airline",
            "Founded in 1985, the Dubai-based airline known as Emirates has significantly disrupted the long-haul market with its one-stop",
            "Julius Nyerere International Airport (DAR)-based Air Tanzania has just placed an order with Boeing for a 787-8 Dreamliner,",
            "For more than two decades, Concorde made the dream of supersonic air travel a reality for a lucky",
            "Nigeria’s Ibom Air has placed an order with Airbus for 10 Airbus A220s. The order is broken down",
            "Could Indianapolis be connected non-stop to London next summer? British Airways has shown its intention, although the situation",
            "For European winter tourists, Kiruna Airport in northern Sweden is a gateway to the Arctic Circle. Before the",
            "Austrian Airlines is a key member of the Lufthansa Group. Based in Vienna, the carrier flies more than",
            "Singapore Airlines has revealed the luxurious business class cabin that it will soon roll out on its Boeing",
            "At the last Dubai Air Show, which was held in 2019, Air Arabia placed a sizeable order for",
            "New Indian low-cost startup airline Akasa Air has ordered 72 Boeing 737 MAX aircraft. The order was placed",
            "Welcome to our 16th routes newsletter! It comes soon after the start of the aviation winter season 2021,",
            "Qatar has added the UK and several other European countries to its travel red list after rising COVID",
            "The Boeing 737 family is immensely popular, with almost 11,000 examples from the entire series having been produced",
            "On Tuesday, Franco-Italian regional turboprop manufacturer ATR announced that it had received a new order for its ATR",
            "Qatar Airways has submitted plans to use the A380 to Manchester next summer, replacing the B777-300ER on the",
            "During the Dubai Air Show in the UAE on Tuesday, it was announced that one of West Africa’s",
            "Brazilian regional jet manufacturer Embraer’s new E-Jet E2 series has a striking nickname: the Profit Hunter. This refers",
            "American Airlines has announced that will soon break ground on a massive new Admirals Club at Austin-Bergstrom International",
            "Qatar has added the UK and several other countries to its travel red list after rising COVID cases.",
            "Earlier this week, Indigo Partners announced a massive 255 Airbus A320neo family order during the Dubai Airshow. This",
            "Vietnam Airlines will win the race against Bamboo Airways to launch the first nonstop flights between the United",
            "The Wizz Air Group is now expecting 47 A321XLRs. Some 27 aircraft were ordered at the Dubai Air",
            "The third day of the Dubai Airshow has wrapped up, and it’s been another day of orders, orders,",
            "The long-haul airline French bee is ready to connect the Paris-Orly International Airport with Los Angeles beginning March",
            "President of Emirates, Sir Tim Clark, revealed today in a media roundtable that the airline’s stunning premium economy",
            "The long-haul airline French bee is ready to connect the Paris-Orly International Airport with Los Angeles beginning April",
            "airBaltic has revealed that 100% of its active workforce is now vaccinated against COVID-19. The airline now joins",
            "An Australian Transport Safety Bureau (ATSB) investigation has found the failure to remove two downlock pins before departure",
            "All Nippon Airways (ANA) will introduce two aircraft over the next year sporting livery inspired by the Japanese",
            "Spirit Airlines has a big week planned with 31 new routes starting in time for the Thanksgiving holiday",
            "Regional Express (Rex) will start flying the final missing link on Australia’s golden triangle, launching flights on the",
            "As expected, many new aviation deals, investments, and projects have been announced at the 2021 Dubai Airshow. One",
            "Canada’s Lynx Air has confirmed it will launch next year, initially flying a fleet of three Boeing 737",
            "Eighteen years after its last flight, Concorde continues to fascinate people. With its power to fly twice the",
            "A United Boeing 757 faced a small fire while on the ground in Boston’s Logan International Airport. The",
            "Allowed to operate to only two Cuban airports since the restart of operations six months ago, Russian charter",
            "Everyone knows about Turkish Airlines’ fast growth, comprehensive network, and fleet. However, there’s one narrowbody that has been",
            "United Kingdom Regional airline Flybe has announced its new headquarters, and its first crew base will be at",
            "Malaysian low-cost carrier AirAsia is a large airline in its own right, with nearly 100 aircraft in its",
            "With Antarctica’s summer season now well underway, Icelandair has helped transport a team of researchers there. The Icelandic",
            "During the Dubai Air Show, Emirates and GE Aviation have signed an MoU to operate a test flight",
            "Pilots are being relocated out of Hong Kong due to the city’s strict COVID-19 measures. Cathay Pacific is",
            "Dubai-based luxury hotel group FIVE has been revealed as the launch customer of the Airbus A220 private jet,",
            "The &#8220;Hump&#8221; refers to the mountainous area at the eastern edge of the Himalayas, north of Myanmar. This",
            "The end of a travel ban between The United Arab Emirates (UAE) and Nigeria could happen if both",
            "Etihad Airways is weighing up whether it will follow through on its orders for certain Airbus and Boeing",
            "Qatar Airways could be close to announcing an order for the 777X freighter. The CEO of the Middle",
            "A woman in Singapore has been given jail time after being found guilty of filing false insurance claims",
            "While American, Delta, and United have many types and variants, it’s not always clear which is the most",
            "The Canadian ultra-low-cost carrier Flair Airlines has announced it will expand its connectivity to Mexico by launching routes",
            "SpiceJet has reached a settlement with Boeing over the 32-month grounding of the 737 MAX. Stock filings did",
            "Eurowings has launched a new route between Zurich and Pristina last week. In doing so, Eurowings has become",
            "So far in 2021, Avianca has lost US$1.012 billion, due to the impact of the COVID-19 crisis and",
            "WestJet has announced another route expansion for 2022. The airline will connect its hub at Calgary International Airport",
            "A joint operation by New Zealand Police and New Zealand Customs has foiled a methamphetamine smuggling racket at",
            "United Airlines will relaunch flights to Singapore in January. Flights will initially resume four times per week as",
            "The Chairman of state-owned Emirates sparked a ripple of interest this week after raising the possibility of selling",
            "One more airline could soon join the list of carriers serving the very busy and lucrative India-UAE sector.",
            "Eastern Airways is to begin flying between Cornwall’s Newquay Airport and London, reconnecting the English regional airport to",
            "Emirates President Sir Tim Clark has revealed to Simple Flying that he has no visibility on when the",
            "Low-cost carriers IndiGo and Go First are both considering unbundling fares and removing free checked baggage from tickets.",
            "UK low-cost carrier easyJet has won a sustainability award for its new pilot and cabin crew uniforms made",
            "Turkish Airlines plans a record summer to the US, with more flights from Istanbul than ever before. Some",
            "It is not uncommon for airports to serve two cities. Leeds Bradford Airport in Yorkshire, UK, is just",
            "After years of drought and shrinking order books, Boeing has turned a page in the Indian domestic market.",
            "Norway’s largest regional airline Widerøe plans to operate some Finland to Norway flights on behalf of Finnair starting",
            "Brussels Airlines has announced a significant new rebranding. The airline has a new logo, livery, and color scheme",
            "Earlier this week, the new Flybe revealed that Birmingham would be its headquarters and its initial base, leading",
            "Aerospace manufacturer Airbus has left the Dubai Airshow with 408 orders (269 firm orders and 139 commitments) for",
            "We have all taken low-cost of budget airline flights that park up far from the terminal. Even if",
            "Today is a big day for Singapore Airlines and its Airbus A380 fleet. The carrier will reintroduce the",
            "It’s a tough job spotting a passenger Boeing 747 these days. Yet, the Queen of the Skies is",
            "When British Airways and Air France decided to retire their supersonic Concorde airliners in 2003, a key factor",
            "Iceland’s PLAY has today revealed that two new A320neos have been acquired on lease from China Aircraft Leasing",
            "The Boeing 777X made its public debut at the Dubai Airshow this week, attracting praise from numerous key",
            "The Boeing 747 is becoming an increasingly rare aircraft. The popular 747-400 variant isn’t getting any younger, and",
            "Three Cathay Pacific 747 pilots were confirmed to have been infected with COVID-19 in the past week. Company",
            "The term Sustainable Aviation Fuel is becoming a common catchphrase as the airline industry commits to net-zero within",
            "United Airlines has resumed sales of alcohol on its flights this week. Passengers in economy class on flights",
            "Iraqi Airways has deployed one of its Boeing 747-400 for an emergency repatriation flight. The flight was carrying",
            "Grupo Aeroméxico is Mexico’s oldest active airline and one of the most known brands across Latin America. The",
            "Russia’s Sukhoi Superjet (SSJ) has proven to be a hit in the country of its manufacture, but has",
            "An Ethiopian Airlines Airbus suffered extensive wing damage after a hard landing in Johannesburg earlier this month. The",
            "Virgin Australia has signed a letter of intent to add a further seven Boeing 737-800 NG aircraft to",
            "Malaysia Airlines and Singapore Airlines have rebooted and upgraded their previous codeshare arrangements between Kuala Lumpur and Singapore.",
            "Foundation bricks for a future Tata-owned single airline company are possibly being laid with news of a likely",
            "Born in the Pacific Northwest, US carrier Alaska Airlines serves destinations throughout the US, Canada, and Mexico. Historically",
            "Getting in on the surging demand for air cargo transportation, flypop has leased an Airbus A330 from Hi",
            "Commercial flights between Singapore and India could be resuming in the coming days after nearly two years of",
            "After costing over €1 billion to construct, Ciudad Real International Airport opened in 2009. It closed three years",
            "While an unmistakable aircraft, the Airbus A380 hasn’t resulted in the commercial success that its manufacturer might have",
            "Lufthansa has bought $250 million worth of Sustainable Aviation Fuel (SAF) over the next three years. In a",
            "Canada’s WestJet has 14 bookable routes to Europe next summer, exactly half by the B737 MAX 8 and",
            "Getting in on the surging demand for air cargo transportation, flypop has partnered with Hi Fly to begin",
            "Despite falling out of favor with numerous airlines due to its inefficiency compared with other modern widebodies, the",
            "The British-French supersonic airliner Concorde was a technological marvel that made supersonic dreams a reality for its 27",
            "South Korea’s transport ministry indicated today that it is ready to re-certify the MAX this coming Monday. The",
            "Emirates, British Airways, Singapore Airlines, China Southern, and Korean Air have A380 flights this week. Between them, there",
            "German flag carrier Lufthansa is a well-known operator of the Boeing 747, having operated several passenger-carrying variants over",
            "Rolls-Royce today shared that its all-electric plane has set three new world records. One of these achievements is",
            "flydubai’s operations have now already recovered, according to the airline’s CEO Ghaith al Ghaith. Speaking to Simple Flying",
            "Emirates, British Airways, Singapore Airlines, China Southern, and Korean Air have A380 flights this week. There are 33",
            "Qatar Airways has made an arrival in Almaty, Kazakhstan. The carrier made its inaugural flight on Friday, making",
            "British Airways has resumed Heathrow to Las Vegas and Gatwick to Tampa, while on the day of writing,",
            "Pluna Líneas Aéreas Uruguayas commenced operations on November 19th, 1936. The airline was Uruguay’s national airline, operating passenger",
            "Aerolíneas Argentinas heavily increased its fleet in December 2020, following the merger with Austral. The State carrier received",
            "CSA, the Czech flag carrier, has lost 105 million Czech Crown ($4.6 million) in the first nine months",
            "The Brazilian OEM Embraer expects the Latin American and Caribbean region to need 2,400 new aircraft by 2040,",
            "Alaska Airlines is a Pacific Northwest powerhouse that serves destinations throughout the US, Canada, and Mexico. Historically a",
            "Copa Airlines is looking to accelerate the delivery of several Boeing 737 MAX units, according to Pedro Heilbron,",
            "Airbus obtained its second order for the A350 Freighter. The CMA CGM Group, a company focused on shipping",
            "With a fleet of 117 Airbus A320 family aircraft, budget operator Allegiant adheres quite closely to the low-cost",
            "Irish low-cost carrier Ryanair has decided to delist itself from the London stock exchange to comply with European",
            "There is good news coming from Air Canada today as the airline announced that it would be withdrawing",
            "German national flag carrier Lufthansa is reportedly talking to Boeing about buying a cargo version of its new",
            "Before establishing Asiana Airlines in 1988, national flag carrier Korean Air had a monopoly on the South Korean",
            "A Russian auction house is selling a damaged Sukhoi Superjet 100 for just over $1 million. The aircraft",
            "SpiceJet has officially resumed passengers operations with the Boeing 737 MAX after a 32-month grounding. VT-MXH took to",
            "Leaders of the US House Transportation and Infrastructure Committee have requested a government review into the Federal Aviation",
            "Ecuador has a new carrier, under the name EQUAIR. This new startup will start flying next month and",
            "A few kilometers away from Mexico City International Airport (MEX) lies the abandoned construction of what was supposed",
            "Between 350,000 and 400,000 new babies are born around the world every day. While the vast majority of",
            "The South American carrier Avianca has the third-largest fleet in Latin America, after LATAM Airlines Group and Azul",
            "Qatar Airways is unusual amongst airlines in that it maintains a fleet of private aircraft alongside its commercial",
            "An Airbus A319 operated by Spanish low-cost carrier Volotea had to make an emergency landing on November 19th",
            "Azul Linhas Aereas has the second-largest fleet in Latin America, just behind LATAM Airlines Group. The Brazilian carrier",
            "The Boeing 787 and Airbus A350 are, of course, major competitors. They were both launched as clean sheet,",
            "It’s been aboutt 14 years and one month since the Airbus A380 entered service with Singapore Airlines. At",
            "With the busy holiday season approaching, JetBlue is hoping for a disruption-free next few weeks. Having seen the",
            "While Norwegian regional airline Widerøe doesn’t fly as far afield as flag carrier SAS, it plays a vital",
            "As we move closer to one of the busiest travel periods of the year, a passenger’s weapon accidentally",
            "Hello and welcome to the 35th iteration of our Sunday digest! The Dubai Air Show has been stealing",
            "Nordic charter carrier Sunclass Airlines will modernize its fleet by taking delivery of an Airbus A330neo in 2022.",
            "Franco-Italian aircraft manufacturer ATR has been talking about its recent success at the Dubai Air Show and the",
            "Tomorrow will mark 18 years since the miraculous landing of a DHL Airbus A300 Freighter in Baghdad, Iraq.",
            "Franco-Italian aircraft manufacturer ATR has been talking about its recent success at the Dubai Airshow and the launch",
            "Indian airlines continued their strong recovery into October. Traffic data for the month shows 8.98 million passengers taking",
            "A Brussels Airlines Airbus A330-300 took off from Brussels, Belgium on November 19th to head to New York,",
            "It’s been two weeks since British Airways reintroduced its Airbus A380s to the fleet. The aircraft has been",
            "Just before the weekend arrived, we reported that flypop partnered with Hi Fly to commence LOPA cargo operations"
      ]
}